CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Utilities/STM32_EVAL/STM324x7I_APP/bsp/bsp.c

#include <stdio.h>
#include <string.h>
#include <stm32f4xx.h>
#include "bsp.h"
#include "uart1.h"
#include "printer.h"
#include "vioce.h"
#include "uart4.h"
#include "serialscreen.h"
#include "uart3.h"
#include "bill.h"
#include "coin.h"
#include "mini_hopper.h"
#include "user_record.h"
#include "delay.h"
#include "uart5.h"
#include "flash.h"
#include "rtc.h"
 /*******************************************************************************
 * 函数名称:WaitTimeInit                                                                     
 * 描    述:把WaitTime从新安排到新的值                                                                  
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
 void  WaitTimeInit(uint8_t *Time)
 {
	*Time = 120;
 }
 
	/*******************************************************************************
 * 函数名称:MachineHeatSet()                                                                     
 * 描    述:根据时间设置机器的加热和制冷                                                               
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2015年04月215日                                                                    
 *******************************************************************************/ 
#define heat_hours    8
#define heat_minutes  00
#define close_hours   13
#define close_minute  30
uint8_t old_hour=0;
uint8_t old_minute=0;
void MachineHeatSet(void)
{
#ifndef test
	static uint32_t heat_minute_total = 0;
	static uint32_t close_minute_totoal = 0;
	static uint32_t current_minute_totoal = 0;
	heat_minute_total = heat_hours*60 + heat_minutes ;
	close_minute_totoal = close_hours*60 + close_minute ;
	current_minute_totoal = TimeDate.Hours*60+TimeDate.Minutes;
	RTC_TimeShow();//获取时间的结构体
	if((current_minute_totoal>=heat_minute_total)&&(current_minute_totoal<close_minute_totoal))
	{
		if(0==OrderSetTemper(0x3C)) OrderSetTemper(0x3C); //加热
	}
	else
	{
		if(0==OrderSetTemper(0x63)) OrderSetTemper(0x63); //关加热
	} 

#endif
}
 /*******************************************************************************
 * 函数名称:FindMeal                                                                     
 * 描    述:查找那个地方有餐                                                                  
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
 uint16_t   Balance;
 uint8_t    DisplayTimes;
 uint8_t    Line = 0,Column = 0 ;
 bool FindMeal(MealAttribute *DefineMeal) 
 {
	for(Line = 0; Line < FloorMealNum; Line++)  //查找层
	{
		for(Column = 0; Column < 3; Column++)     //查找列
		{
			if(DefineMeal[UserActMessageWriteToFlash.UserAct.MealID - 1].Position[Line][Column] > 0)    
			return true;                                   //当该位置有餐的话返回0
		}
	}
	return false ;
 }

	/*******************************************************************************
 * 函数名称:MoveToFisrtMeal();                                                                    
 * 描    述:找到用户选择的第一份餐品，并且移动到相应位置                                                              
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年6月25日                                                                    
 *******************************************************************************/ 
void MoveToFisrtMeal(void)
{
	if(UserActMessageWriteToFlash.UserAct.MealCnt_1st>0)
	{
		UserActMessageWriteToFlash.UserAct.MealID = 0x01; 
	}               
	else if(UserActMessageWriteToFlash.UserAct.MealCnt_2nd>0)
	{
        UserActMessageWriteToFlash.UserAct.MealID = 0x02;
	}               
	else if(UserActMessageWriteToFlash.UserAct.MealCnt_3rd>0)
	{
		UserActMessageWriteToFlash.UserAct.MealID = 0x03;   
	}
	else if(UserActMessageWriteToFlash.UserAct.MealCnt_4th>0)
	{
		UserActMessageWriteToFlash.UserAct.MealID = 0x04;   
	}
	if(FindMeal(DefineMeal)) /*查找餐品ID的位置*/
	{
		//OrderSendCoord(Line,Column);
	}   
}
 
	/*******************************************************************************
 * 函数名称:PrintTick                                                                     
 * 描    述:是否打印小票                                                                
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
			
void PrintTickFun(uint32_t *PrintTickFlag)
{      
	if(*PrintTickFlag == 0x00000001 )
	{
		/*打印小票的函数*/
		SPRT();
	}    
	if(*PrintTickFlag == 0x00000002 )
	{
        /*不打印*/
	}
	
