CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Utilities/STM32_EVAL/STM324x7I_APP/bsp/bsp.c
}   
	/*******************************************************************************
 * 函数名称:StrToBCD                                                                
 * 描    述:将刷卡的数据读取转换后添加到数组中                                                             
 *           可以将字符串先转换为Int                                                                    
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:-1：错误 , 返回数组的长度                                                             
 * 修改日期:2014年9月2日                                                                    
 *******************************************************************************/ 
int8_t StrToBCD( uint8_t* pDest,const uint8_t* pSrc, uint8_t destLen)
{
	 uint8_t i=0;
	 for(i=0;i<destLen;i++)
	 {
		 if((pSrc[i]<'0')||(pSrc[i]>'9')) 
		 return -1;
	 }
	 if( destLen/2==0)
	 {
		for(i=0;i<destLen;i+=2)
		{
			pDest[i/2] =(((pSrc[i]-0x30)<<4)|(pSrc[i+1]-0x30));
		}
		return  destLen/2;
	 }
	 else
	 {
		pDest[0]= (pSrc[0]-0x30);
		for(i=1;i<destLen;i+=2)
		{
			 pDest[(i+1)/2] =(((pSrc[i]-0x30)<<4)|(pSrc[i+1]-0x30));
		}
		return  destLen/2;          
	 }
}

	/*******************************************************************************
 * 函数名称:IntToBCD                                                                
 * 描    述:将刷卡的数据读取转换后添加到数组中                                                             
 *           将int型的变量转换为BCD数组                                                               
 * 输    入:int                                                                
 * 输    出:bcd码的数组                                                                    
 * 返    回:-1：错误 , 返回数组的长度                                                             
 * 修改日期:2014年9月2日                                                                    
 *******************************************************************************/ 
void IntToBCD( uint8_t* pDes,const uint32_t  iv, uint8_t destLen)
{
	uint8_t sv[20]={0};
	StrToBCD(pDes,sv,sprintf((char *)sv,"%010u",iv));
}
	/*******************************************************************************
 * 函数名称:TrackDateToBuff                                                                
 * 描    述:将刷卡的数据读取转换后添加到数组中                                                             
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年9月2日                                                                    
 *******************************************************************************/ 
//void TrackDateToBuff(void)
//{
//  uint8_t i;
//  uint8_t  temp_t[10]={0};
//  uint8_t  TraceNum[10]={0};
//  //银联
//  if(UserActMessageWriteToFlash.UserAct.PayType == '2') //银行卡
//  {
//    for(i=0;i<10;i++)
//      PosDevNum[3+i]=0x00; 
//    PosDevNum[2]= strlen(UpDeductData.szPosId);
//    for(i=0;i<PosDevNum[2];i++)
//    {
//      PosDevNum[3+i]= UpDeductData.szPosId[i]; //终端号
//    }
//    PosTenantNum[2]= strlen(UpInitData[0].szMerchantId);
//    for(i=0;i<PosTenantNum[2];i++)
//    {
//      PosTenantNum[3+i]=UpInitData[0].szMerchantId[i]; //商户号
//    }
//    PosBatchNum[2]= sprintf(TraceNum,"%d",UpDeductData.lTraceNo);
//    for(i=0;i<PosBatchNum[2];i++)
//    {
//      PosBatchNum[3+i]=TraceNum[i];  //流水号
//    }
//    PosUserNum[2]= strlen(UpDeductData.szCardNo);
//    for(i=0;i<PosUserNum[2];i++)
//    {
//      PosUserNum[3+i]= UpDeductData.szCardNo[i]; //卡号
//    } 
//  }
//  //UpDeductData.szPosId;
//  //UpInitData.szMerchantId;
//  //UpDeductData.lTraceNo;
//  //UpDeductData.szCardNo
//  //深圳通
//  else if(UserActMessageWriteToFlash.UserAct.PayType == '3')
//  {
//    PosDevNum[2]= sprintf(temp_t,"%d",SztReductInf.machineNum);
//    for(i=0;i<PosDevNum[2];i++)
//      PosDevNum[3+i]=temp_t[i];  //终端号
//    
//    PosTenantNum[2]= strlen(UpInitData[0].szMerchantId);   
//    for(i=0;i<PosTenantNum[2];i++)
//      PosTenantNum[3+i]=UpInitData[0].szMerchantId[i];  //商户号
//    
//    PosBatchNum[2]= sprintf(temp_t,"%d",SztReductInf.TradeNum);  
//    for(i=0;i<PosBatchNum[2];i++)
//      PosBatchNum[3+i]=temp_t[i];  //流水号
//    
//    PosUserNum[2]= sprintf(temp_t,"%d",SztReductInf.CardNum);    
//    for(i=0;i<PosUserNum[2];i++)
//      PosUserNum[3+i]= temp_t[i];   //卡号 
//  }    
//  //SztReductInf.machineNum;
//  //UpDeductData.szMerchantld;  
//  //SztReductInf.TradeNum;
//  //SztReductInf.CardNum;  
//  //s
//}


	/*******************************************************************************
 * 函数名称:WaitPayMoney                                                                     
 * 描    述:等待接收用户投的钱                                                                 
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 

uint8_t CurrentPoint = 1 ; 
uint8_t UserPayMoney =0 ;
uint8_t NewCoinsCnt=0;
uint8_t OldCoinsCnt=0;
uint8_t  WaitPayMoney(void)
{
	uint8_t reduce_money_flag = 0;
	uint32_t temp1=0,temp2=0;
	//VariableChage(wait_payfor,WaitTime);
	switch(CurrentPoint)
	{
		case 1 : 
		{
		/*显示付款方式，现金，银行卡，深圳通*/
			if(WaitTime<53)
			{
				//CurrentPoint = 3;
				/*支付方式*/           
				//UserActMessageWriteToFlash.UserAct.PayType = 0x31;/* 现金支付*/
				//取消自动
				//PlayMusic(VOICE_3);
				//if(!OpenCashSystem()){OpenCashSystem();};// printf("cash system is erro2");  //关闭现金接受
			}
		}break;
		case 2:  //由屏幕控制跳转
		{
		/*跳到选择付款方式界面*/
			CurrentPoint = 3 ;
			UserActMessageWriteToFlash.UserAct.PayType = 0x31 ;/* 现金支付*/
			GetDiscountCost(UserActMessageWriteToFlash.UserAct.PayType);/*根据支付方式计算餐品的折后价格和应付价格*/
		}break; 
		case 3 :  //读钱
		{
			UserPayMoney = ReadBills();
			if(UserPayMoney !=0 )    //表示收到了钱
			{
				UserActMessageWriteToFlash.UserAct.PayAlready  += UserPayMoney;
				UserActMessageWriteToFlash.UserAct.PayForBills += UserPayMoney;   
				//VariableChage(payment_bill,UserActMessageWriteToFlash.UserAct.PayForBills);
				UserPayMoney = 0 ;
			}
			CurrentPoint = 6 ;
		}break;
		case 5 ://会员卡支付   
		{
			UserActMessageWriteToFlash.UserAct.PayType = 0x34 ;/*会员卡支付*/
			GetDiscountCost(UserActMessageWriteToFlash.UserAct.PayType);/*根据支付方式计算餐品的折后价格和应付价格*/
			UserActMessageWriteToFlash.UserAct.PayForCards = UserActMessageWriteToFlash.UserAct.LastPayShould - UserActMessageWriteToFlash.UserAct.PayAlready;
			UserActMessageWriteToFlash.UserAct.PayAlready += UserActMessageWriteToFlash.UserAct.PayForCards ;
			UART3_ClrRxBuf();
			CurrentPoint = 6;
		}break;
		case 6 : //统计钱数
		{
			VariableChage(payment_coin,UserActMessageWriteToFlash.UserAct.PayAlready);     
			if(UserActMessageWriteToFlash.UserAct.PayAlready +UserActMessageWriteToFlash.UserAct.PayForCards>=UserActMessageWriteToFlash.UserAct.LastPayShould)     //投的钱大于等于要付的钱
			{
				CurrentPoint = 9;
			}
			else
			{ 
				CurrentPoint = 3; 
			}   
		}break;
		case 7 :  /*银行卡支付由屏幕控制*/
		{
			WaitTimeInit(&WaitTime);
			PageChange(SwipingCard_interface);
			UserActMessageWriteToFlash.UserAct.PayType = 0x32 ;/* 银行卡支付*/
			GetDiscountCost(UserActMessageWriteToFlash.UserAct.PayType);/*根据支付方式计算餐品的折后价格和应付价格*/
#ifndef test
			reduce_money_flag = GpbocDeduct((UserActMessageWriteToFlash.UserAct.LastPayShould-UserActMessageWriteToFlash.UserAct.PayAlready)*100);
#else
			//reduce_money_flag = GpbocDeduct(UserActMessageWriteToFlash.UserAct.LastPayShould-UserActMessageWriteToFlash.UserAct.PayAlready);
#endif
			if(reduce_money_flag == 1)
			{
				UserActMessageWriteToFlash.UserAct.PayForCards = UserActMessageWriteToFlash.UserAct.LastPayShould - UserActMessageWriteToFlash.UserAct.PayAlready;
				UserActMessageWriteToFlash.UserAct.PayAlready += UserActMessageWriteToFlash.UserAct.PayForCards ;
				UART3_ClrRxBuf();
				CurrentPoint =6;
			}
			else
			{
				WaitTimeInit(&WaitTime);
				PageChange(Acount_interface);
				CurrentPoint = 0;
				/*支付方式*/
				UserActMessageWriteToFlash.UserAct.PayType = 0x30;//清空支付方式        
				GetDiscountCost(UserActMessageWriteToFlash.UserAct.PayType);/*根据支付方式计算餐品的折后价格和应付价格*/        
				UART3_ClrRxBuf();
			}
		}break;
		case 8 :/*深圳通支付由屏幕控制*/
		{
			WaitTimeInit(&WaitTime);
			PageChange(SwipingCard_interface);
			UserActMessageWriteToFlash.UserAct.PayType = 0x33 ;/* 深圳通支付*/
			GetDiscountCost(UserActMessageWriteToFlash.UserAct.PayType);/*根据支付方式计算餐品的折后价格和应付价格*/
#ifndef test
			reduce_money_flag = SztDeduct((UserActMessageWriteToFlash.UserAct.LastPayShould- UserActMessageWriteToFlash.UserAct.PayAlready)*100);
#else
			//reduce_money_flag = SztDeduct(UserActMessageWriteToFlash.UserAct.LastPayShould- UserActMessageWriteToFlash.UserAct.PayAlready);//扣一分
#endif
			if(reduce_money_flag == 1)
			{
				UserActMessageWriteToFlash.UserAct.PayForCards = UserActMessageWriteToFlash.UserAct.LastPayShould - UserActMessageWriteToFlash.UserAct.PayAlready;
				UserActMessageWriteToFlash.UserAct.PayAlready += UserActMessageWriteToFlash.UserAct.PayForCards ;
				UART3_ClrRxBuf();
				CurrentPoint =6;
			}
			else
			{
				WaitTimeInit(&WaitTime);
				PageChange(Acount_interface);
				CurrentPoint = 0;
				/*支付方式*/
				UserActMessageWriteToFlash.UserAct.PayType = 0x30;//清空支付方式
				GetDiscountCost(UserActMessageWriteToFlash.UserAct.PayType);/*根据支付方式计算餐品的折后价格和应付价格*/
				UART3_ClrRxBuf();
			}
		}break;
		case 9 :  //付款成功关闭所有的收银系统
		{
			UserActMessageWriteToFlash.UserAct.MoneyBack = UserActMessageWriteToFlash.UserAct.PayAlready - UserActMessageWriteToFlash.UserAct.LastPayShould;    
			UserActMessageWriteToFlash.UserAct.Meal_totoal = UserActMessageWriteToFlash.UserAct.MealCnt_4th+UserActMessageWriteToFlash.UserAct.MealCnt_3rd+UserActMessageWriteToFlash.UserAct.MealCnt_2nd+UserActMessageWriteToFlash.UserAct.MealCnt_1st;
			UserActMessageWriteToFlash.UserAct.MoneyBackShould = UserActMessageWriteToFlash.UserAct.MoneyBack; //记录付钱之后第一次应该退的币   
			VariableChage(mealout_totle,UserActMessageWriteToFlash.UserAct.Meal_totoal);  
			//将需要打印的数据赋值到相关结构体    
			Print_Struct.P_Type1st   = UserActMessageWriteToFlash.UserAct.MealType_1st;
			Print_Struct.P_Type2nd   = UserActMessageWriteToFlash.UserAct.MealType_2nd;
			Print_Struct.P_Type3rd   = UserActMessageWriteToFlash.UserAct.MealType_3rd;
			Print_Struct.P_Type4th   = UserActMessageWriteToFlash.UserAct.MealType_4th;
			Print_Struct.P_Number1st = UserActMessageWriteToFlash.UserAct.MealCnt_1st;
			Print_Struct.P_Number2nd = UserActMessageWriteToFlash.UserAct.MealCnt_2nd;
			Print_Struct.P_Number3rd = UserActMessageWriteToFlash.UserAct.MealCnt_3rd;
			Print_Struct.P_Number4th = UserActMessageWriteToFlash.UserAct.MealCnt_4th;
			Print_Struct.P_Price1st   = UserActMessageWriteToFlash.UserAct.MealPrice_1st;
			Print_Struct.P_Price2nd   = UserActMessageWriteToFlash.UserAct.MealPrice_2nd;
			Print_Struct.P_Price3rd   = UserActMessageWriteToFlash.UserAct.MealPrice_3rd;
			Print_Struct.P_Price4th   = UserActMessageWriteToFlash.UserAct.MealPrice_4th;      
			Print_Struct.P_Cost1st   = UserActMessageWriteToFlash.UserAct.LastMealCost_1st;
			Print_Struct.P_Cost2nd   = UserActMessageWriteToFlash.UserAct.LastMealCost_2nd;
			Print_Struct.P_Cost3rd   = UserActMessageWriteToFlash.UserAct.LastMealCost_3rd;
			Print_Struct.P_Cost4th   = UserActMessageWriteToFlash.UserAct.LastMealCost_4th;
			Print_Struct.P_paymoney  = UserActMessageWriteToFlash.UserAct.PayForBills + UserActMessageWriteToFlash.UserAct.PayForCoins +UserActMessageWriteToFlash.UserAct.PayForCards ;
			Print_Struct.P_PayShould = UserActMessageWriteToFlash.UserAct.LastPayShould ;
			Print_Struct.P_MoneyBack = UserActMessageWriteToFlash.UserAct.MoneyBack ;
			CurrentPoint = 0 ;
			return  Status_OK;
		}
		default :break;
	}
	if(WaitTime<=1) 
	{
		WaitTimeInit(&WaitTime);
		PageChange(Menu_interface);//超时退出用户餐品数量选择界面
		if(!CloseCashSystem()){CloseCashSystem();};//printf("cash system is erro6\r\n");  //关闭现金接受
		CurrentPoint = 0 ;
		temp1= UserActMessageWriteToFlash.UserAct.MoneyBack= UserActMessageWriteToFlash.UserAct.PayAlready; //超时将收到的钱以硬币的形式返还
		temp2= UserActMessageWriteToFlash.UserAct.MoneyBackShould= UserActMessageWriteToFlash.UserAct.PayAlready; //数据需要记录
		ClearUserBuffer();//清空用户数据
		UserActMessageWriteToFlash.UserAct.MoneyBack= temp1;
		UserActMessageWriteToFlash.UserAct.MoneyBackShould= temp2;
		//SaveUserData();//保存用户数据  
		if(UserActMessageWriteToFlash.UserAct.MoneyBack>0)
			Current= hpper_out;
		else
			Current= current_temperature;
	}
	else
	{
		if(WaitTime%5==1) 
		{
			if(UserActMessageWriteToFlash.UserAct.PayType==0x31)
			{
				PlayMusic(VOICE_3);
			}
			else
			{
				PlayMusic(VOICE_2);
			}        
		}    
	}
	return  Status_Action;
}                                               


uint8_t WaitMeal(void)
{
//	uint8_t MealoutCurrentPointer=0;
//	uint8_t takemeal_timecnt=0;
//	//static uint8_t Cmd[20]={0x05, 0x31, 0x30, 0x30, 0x31, 0x30 ,0x30, 0x36, 0x34, 0x30, 0x30, 0x30, 0x34, 0x4D, 0x31, 0x35, 0x43, 0x03, 0x0D ,0x0A};
//	uint8_t temp;
//	do
//	{
//		manageusart6data();  //将机械手的数据处理放在取餐头，不适用while(1)
//		DealSeriAceptData(); //只处理打印数据
//		switch(MealoutCurrentPointer)
//		{
//			case 0 : /*查找用户所选餐品的位置*/
//			{
//				//赋值当前UserActMessageWriteToFlash.UserAct.MealID
//				if(UserActMessageWriteToFlash.UserAct.MealCnt_1st>0)
//				{
//					UserActMessageWriteToFlash.UserAct.MealID = UserActMessageWriteToFlash.UserAct.MealType_1st; 
//				}               
//				else if(UserActMessageWriteToFlash.UserAct.MealCnt_2nd>0)
//				{
//					UserActMessageWriteToFlash.UserAct.MealID = UserActMessageWriteToFlash.UserAct.MealType_2nd; 
//				}               
//				else if(UserActMessageWriteToFlash.UserAct.MealCnt_3rd>0)
//				{
//					UserActMessageWriteToFlash.UserAct.MealID = UserActMessageWriteToFlash.UserAct.MealType_3rd; 
//				}
//				else if(UserActMessageWriteToFlash.UserAct.MealCnt_4th>0)
//				{
//					UserActMessageWriteToFlash.UserAct.MealID = UserActMessageWriteToFlash.UserAct.MealType_4th; 
//				}
//				else
//				{   
//					 //如果餐品全部出完，退出到主界面      
//					 //printf("takeafter_meal\r\n");        
//					PlayMusic(VOICE_12);                
//					return takeafter_meal;
//				}
//				if(FindMeal(DefineMeal)) /*查找餐品ID的位置*/
//				{
//					PlayMusic(VOICE_8); 
//					MealoutCurrentPointer= 1;
//				}
//			//printf("case 0/UserAct.MealID == %d\r\n",UserAct.MealID);             
//			}break;
//			case 1 : /* 发送餐的数目减一*/
//			{            
//				FloorMealMessageWriteToFlash.FloorMeal[Line].MealCount --; 
//				switch(Column)
//				{
//					case 0 :   FloorMealMessageWriteToFlash.FloorMeal[Line].FCount -- ;   break;
//					case 1 :   FloorMealMessageWriteToFlash.FloorMeal[Line].SCount -- ;   break;
//					case 2 :   FloorMealMessageWriteToFlash.FloorMeal[Line].TCount -- ;   break;
//					default:  break;
//				}
//				DefineMeal[UserActMessageWriteToFlash.UserAct.MealID - 1].Position[Line][Column]--;
//				DefineMeal[UserActMessageWriteToFlash.UserAct.MealID - 1].MealCount--;
//				WriteMeal();
//				StatisticsTotal();
//				DispLeftMeal(); 
//				MealoutCurrentPointer = 2 ;
//			}break ;   
//			case 2 : //根据[Line][Column]的值发送坐标 等待ACK 
//			{
//				//printf("发送行和列的位置，等待响应\r\n");
//				temp =0;
//				temp = OrderSendCoord(Line,Column);
//				
//				if( temp ==1)//发送成功
//				{
//					LinkTime =0;
//					machinerec.rerelative =0;   //不是待机位置
//					MealoutCurrentPointer = 3 ;
//				}
//				else                //发送失败
//				{
//					//printf("send coord error\r\n");
//					err_record |= (1<<SendUR6Erro);
//					return takemeal_erro;
//				}
//			}break;  
//			case 3 :    /*发送取餐命令*/
//			{
//				//查询机械手是否准备好，如果准备好发送取餐命令
//				machinerec.remealaway = 0;  /*初始化*/
//				//如果超时则 返回错误，
//				if(LinkTime > 10)    //超时
//				{
//					LinkTime =0;
//					//printf("move to coord timeout!\r\n");
//					err_record |= (1<<SendUR6Erro);
//					return takemeal_erro;
//				}       
//				if(machinerec.regoal ==1)   //到达取餐点
//				{
//					machinerec.regoal =0 ;
//					temp =0;
//					temp = OrderGetMeal();   //发送取餐命令
//					LinkTime =0;
//					MealoutCurrentPointer=4;                
//					if(temp ==1)       // 取餐命令发送成功
//					{
//						LinkTime =0;
//						MealoutCurrentPointer=4;  
//					}
//					else          //发送失败     
//					{
//						//printf(" send getmeal order error\r\n");
//						err_record |= (1<<SendUR6Erro);
//						return takemeal_erro;
//					}
//				}
//			}break;
//			case 4 :    /*播放语音，请取餐*/
//			{
//				//如果餐品到达取餐口播放语音
//				//如果餐品取出则 跳出子程序进行数据上传  
//				if(machinerec.retodoor == 1)   //到达出餐口
//				{
//					machinerec.retodoor = 0;
//					LinkTime =0;  
//					takemeal_timecnt=1;
//					//播放请取餐语音
//					PlayMusic(VOICE_9);
//				}
//				else if(machinerec.reenablegetmeal ==1)  //取餐5秒了还未取到餐
//				{
//					machinerec.reenablegetmeal =0; //新加的需要把相关标记清零
//					//printf("取餐5秒了还未取到餐\r\n");  
//					err_record |= (1<<GetMealError);
//					return takemeal_erro;
//				}
//				//printf("餐未超过了三分钟还未被取走\r\n");
//				else if( machinerec.remealaway == 1) //餐已被取走
//				{
//				//printf("餐已被取走\r\n");
//					LinkTime =0;
//					machinerec.remealaway = 0;
//					MealoutCurrentPointer=5;
//					break;
//				}
//				else if( machinerec.remealnoaway == 1)  //餐在取餐口过了20秒还未被取走
//				{
//					if( LinkTime >=25) //餐在出餐口未被取走，一直等待时间时间大于20s播放语音提示取餐
//					{
//						PlayMusic(VOICE_10);
//						LinkTime= 0;
//					}
//				}                   
//				else if(takemeal_timecnt==1) //如果没有收到过了20S餐盒没有被取走则从到达出餐口的位置计时
//				{
//					if(LinkTime >=25)
//					{
//						if(UserActMessageWriteToFlash.UserAct.MealID==UserActMessageWriteToFlash.UserAct.MealType_1st)UserActMessageWriteToFlash.UserAct.MealCnt_1st--;
//						else if(UserActMessageWriteToFlash.UserAct.MealID==UserActMessageWriteToFlash.UserAct.MealType_2nd)UserActMessageWriteToFlash.UserAct.MealCnt_2nd--;
//						else if(UserActMessageWriteToFlash.UserAct.MealID==UserActMessageWriteToFlash.UserAct.MealType_3rd)UserActMessageWriteToFlash.UserAct.MealCnt_3rd--;
//						else if(UserActMessageWriteToFlash.UserAct.MealID==UserActMessageWriteToFlash.UserAct.MealType_4th)UserActMessageWriteToFlash.UserAct.MealCnt_4th--;
//						err_record |= (1<<MealNoAway);
//						return takemeal_erro;
//					}
//				}   
//				else   //从发送完取餐命令计时
//				{
//					if(LinkTime>60)
//					{
//						err_record |= (1<<GetMealError);
//						return takemeal_erro; 
//					}                       
//				} 
//			}break;             
//			case 5:     /*对用户数据进行减一*/  //?? 如果需要进行错误退币，需要修该返回值所在范围
//			{
//				machinerec.remealnoaway = 0;
//				machinerec.remealaway = 0;
//				UserActMessageWriteToFlash.UserAct.Meal_takeout++;//取餐数据加
//				VariableChage(mealout_already,UserActMessageWriteToFlash.UserAct.Meal_takeout); //UI显示
//				MealoutCurrentPointer= 0;
//				//printf("case 5/UserAct.MealID == %d\r\n",UserAct.MealID);
//				if(UserActMessageWriteToFlash.UserAct.MealID == UserActMessageWriteToFlash.UserAct.MealType_1st)
//				{
//					UserActMessageWriteToFlash.UserAct.MealCnt_1st--;
//					//if(UserActMessageWriteToFlash.UserAct.MealCnt_1st==0)
//					if(0)
//					{
//						//printf("tookkind_meal\r\n");
//						return tookkind_meal;
//					}
//					else
//					{
//						//printf("tookone_meal\r\n");
//						return tookone_meal;
//					}
//				}
//				else if(UserActMessageWriteToFlash.UserAct.MealID == UserActMessageWriteToFlash.UserAct.MealType_2nd)
//				{
//					UserActMessageWriteToFlash.UserAct.MealCnt_2nd--;
//					//if(UserActMessageWriteToFlash.UserAct.MealCnt_2nd==0)
//					if(0)
//					{
//						//printf("tookkind_meal\r\n");
//						return tookkind_meal;
//					}
//					else
//					{
//						//printf("tookone_meal\r\n");
//					return tookone_meal;
//					}                       
//				}
//				else if(UserActMessageWriteToFlash.UserAct.MealID == UserActMessageWriteToFlash.UserAct.MealType_3rd)
//				{
//					UserActMessageWriteToFlash.UserAct.MealCnt_3rd--;
//					//if(UserActMessageWriteToFlash.UserAct.MealCnt_3rd==0)
//					if(0)
//					{
//						//printf("tookkind_meal\r\n");
//						return tookkind_meal;
//					}
//					else
//					{
//						//printf("tookone_meal\r\n");
//					return tookone_meal;
//					}                       
//				}               
//				else if(UserActMessageWriteToFlash.UserAct.MealID == UserActMessageWriteToFlash.UserAct.MealType_4th)
//				{
//					UserActMessageWriteToFlash.UserAct.MealCnt_4th--;   
//					//if(UserActMessageWriteToFlash.UserAct.MealCnt_4th==0)
//					if(0)
//					{
//						//printf("tookkind_meal\r\n");
//						return tookkind_meal;
//					}
//					else
//					{
//						//printf("tookone_meal\r\n");
//						return tookone_meal;
//					}                       
//				}        
//				else 
//				{
//					printf("tookone_meal err\r\n");
//				}
//			}
//			default:break;
//		}
//	}while(1);
    return tookone_meal;
}   

