CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Utilities/STM32_EVAL/STM324x7I_APP/bsp/bsp.c
	/*******************************************************************************
 * 函数名称:CloseCashSystem                                                                     
 * 描    述:关闭现金接受                                                        
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
#define bill_time  600  //500ms不会出错，100ms纸币机反应不过来
bool CloseCashSystem(void)
{
	uint8_t cnt_t=253;
	CloseCoinMachine();               //关闭投币机 
	delay_ms(bill_time);
	memset(BillDataBuffer,0xFE,sizeof(BillDataBuffer));
	DisableBills();             //设置并关闭纸币机
	do
	{
		cnt_t--;
		delay_ms(1);
		if((RX4Buffer[0]=='0')&&(RX4Buffer[1]=='0'))
		{
			return true;
		}
		else if((RX4Buffer[0]=='F')&&(RX4Buffer[1]=='F'))
		{
			return false;           
		}
	}while(cnt_t);           
	 return false; 
}

bool OpenCashSystem(void)
{
	uint8_t cnt_t=254;  
	OpenCoinMachine();    //打开投币机   
	delay_ms(bill_time);        //需要控制
	memset(BillDataBuffer,0xFE,sizeof(BillDataBuffer));
	SetBills();           //设置并打开纸币机
	do
	{
		cnt_t--;
		delay_ms(1);
		if((RX4Buffer[0]=='0')&&(RX4Buffer[1]=='0'))
		{
			return true;
		}
		else if((RX4Buffer[0]=='F')&&(RX4Buffer[1]=='F'))
		{
			return false;           
		}
	}while(cnt_t);  
	return false; 
}

	/*******************************************************************************
 * 函数名称:ClearingFuntion                                                                     
 * 描    述:结算命令 检验数据是否发送成功，加入没有发送成功，继续发送。全部发送完毕后结算。                                                                   
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
void ClearingFuntion(void)
{
	 
//	RTC_TimeShow();//获得时间
//	if(TimeDate.Hours == 5 || TimeDate.Hours == 19)
//	{
//		// 结算命令 ；
//		//   ClearingFun();     //后台结算命令
//		// BankFlashCard_Upload(); //数据上送    不是退签
//	}                
}
	/*******************************************************************************
 * 函数名称:AcountCopy                                                                   
 * 描    述:用户数据拷贝                                                              
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
void AcountCopy(void)
{
	UserActMessageWriteToFlash.UserAct.MealCnt_1st_t= UserActMessageWriteToFlash.UserAct.MealCnt_1st;
	UserActMessageWriteToFlash.UserAct.MealCnt_2nd_t= UserActMessageWriteToFlash.UserAct.MealCnt_2nd;
	UserActMessageWriteToFlash.UserAct.MealCnt_3rd_t= UserActMessageWriteToFlash.UserAct.MealCnt_3rd;
	UserActMessageWriteToFlash.UserAct.MealCnt_4th_t= UserActMessageWriteToFlash.UserAct.MealCnt_4th; 
}

	/*******************************************************************************
 * 函数名称:GetDiscountCost                                                                   
 * 描    述:获取折后价格 及总的应付款项                                                            
 *                                                                               
 * 输    入:支付方式                                                                   
 * 输    出:true / false                                                                   
 * 返    回:void                                                               
 * 修改日期:2013年1月16日                                                                    
 *******************************************************************************/ 
uint8_t last_discount_1st; //第一种餐品的付款时折扣
uint8_t last_discount_2nd;
uint8_t last_discount_3rd;
uint8_t last_discount_4th;
bool GetDiscountCost(uint8_t payment)
{
	switch(payment)
	{
		case 0x30:{  /*未选择支付方式*/
			last_discount_1st = 100;
			last_discount_2nd = 100;
			last_discount_3rd = 100;
			last_discount_4th = 100;      
		}break;
		/*折扣计算出问题了，需要获取当前餐品的折扣信息*/
		case 0x31:{  /*现金*/
			 /*已知现金支付，根据选择的第一份餐品的内部序号，将该序号下的餐品的折扣信息赋值给用户第一份餐品的折扣用于计算*/
			switch(UserActMessageWriteToFlash.UserAct.MealType_1st) 
			{
				case 0x01:{last_discount_1st = cashcut_1st;};break;
				case 0x02:{last_discount_1st = cashcut_2nd;};break;
				case 0x03:{last_discount_1st = cashcut_3rd;};break;
				case 0x04:{last_discount_1st = cashcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_2nd) 
			{
				case 0x01:{last_discount_2nd = cashcut_1st;};break;
				case 0x02:{last_discount_2nd = cashcut_2nd;};break;
				case 0x03:{last_discount_2nd = cashcut_3rd;};break;
				case 0x04:{last_discount_2nd = cashcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_3rd) 
			{
				case 0x01:{last_discount_3rd = cashcut_1st;};break;
				case 0x02:{last_discount_3rd = cashcut_2nd;};break;
				case 0x03:{last_discount_3rd = cashcut_3rd;};break;
				case 0x04:{last_discount_3rd = cashcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_4th) 
			{
				case 0x01:{last_discount_4th = cashcut_1st;};break;
				case 0x02:{last_discount_4th = cashcut_2nd;};break;
				case 0x03:{last_discount_4th = cashcut_3rd;};break;
				case 0x04:{last_discount_4th = cashcut_4th;};break;
				default :break;
			}
		}break;
		case 0x32:{  /*银联闪付卡*/
			switch(UserActMessageWriteToFlash.UserAct.MealType_1st)
			{
				case 0x01:{last_discount_1st = gboccut_1st;};break;
				case 0x02:{last_discount_1st = gboccut_2nd;};break;
				case 0x03:{last_discount_1st = gboccut_3rd;};break;
				case 0x04:{last_discount_1st = gboccut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_2nd) 
			{
				case 0x01:{last_discount_2nd = gboccut_1st;};break;
				case 0x02:{last_discount_2nd = gboccut_2nd;};break;
				case 0x03:{last_discount_2nd = gboccut_3rd;};break;
				case 0x04:{last_discount_2nd = gboccut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_3rd) 
			{
				case 0x01:{last_discount_3rd = gboccut_1st;};break;
				case 0x02:{last_discount_3rd = gboccut_2nd;};break;
				case 0x03:{last_discount_3rd = gboccut_3rd;};break;
				case 0x04:{last_discount_3rd = gboccut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_4th) 
			{
				case 0x01:{last_discount_4th = gboccut_1st;};break;
				case 0x02:{last_discount_4th = gboccut_2nd;};break;
				case 0x03:{last_discount_4th = gboccut_3rd;};break;
				case 0x04:{last_discount_4th = gboccut_4th;};break;
				default :break;
			}
		}break;
		case 0x33:{  /*深圳通*/
			switch(UserActMessageWriteToFlash.UserAct.MealType_1st)
			{
				case 0x01:{last_discount_1st = sztcut_1st;};break;
				case 0x02:{last_discount_1st = sztcut_2nd;};break;
				case 0x03:{last_discount_1st = sztcut_3rd;};break;
				case 0x04:{last_discount_1st = sztcut_4th;};break;
				default :break; 
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_2nd) 
			{
				case 0x01:{last_discount_2nd = sztcut_1st;};break;
				case 0x02:{last_discount_2nd = sztcut_2nd;};break;
				case 0x03:{last_discount_2nd = sztcut_3rd;};break;
				case 0x04:{last_discount_2nd = sztcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_3rd) 
			{
				case 0x01:{last_discount_3rd = sztcut_1st;};break;
				case 0x02:{last_discount_3rd = sztcut_2nd;};break;
				case 0x03:{last_discount_3rd = sztcut_3rd;};break;
				case 0x04:{last_discount_3rd = sztcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_4th) 
			{
				case 0x01:{last_discount_4th = sztcut_1st;};break;
				case 0x02:{last_discount_4th = sztcut_2nd;};break;
				case 0x03:{last_discount_4th = sztcut_3rd;};break;
				case 0x04:{last_discount_4th = sztcut_4th;};break;
				default :break;
			}        
		}break;
		case 0x34:{ /*会员卡*/
			switch(UserActMessageWriteToFlash.UserAct.MealType_1st)
			{
				case 0x01:{last_discount_1st = vipcut_1st;};break;
				case 0x02:{last_discount_1st = vipcut_2nd;};break;
				case 0x03:{last_discount_1st = vipcut_3rd;};break;
				case 0x04:{last_discount_1st = vipcut_4th;};break;
				default :break; 
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_2nd) 
			{
				case 0x01:{last_discount_2nd = vipcut_1st;};break;
				case 0x02:{last_discount_2nd = vipcut_2nd;};break;
				case 0x03:{last_discount_2nd = vipcut_3rd;};break;
				case 0x04:{last_discount_2nd = vipcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_3rd) 
			{
				case 0x01:{last_discount_3rd = vipcut_1st;};break;
				case 0x02:{last_discount_3rd = vipcut_2nd;};break;
				case 0x03:{last_discount_3rd = vipcut_3rd;};break;
				case 0x04:{last_discount_3rd = vipcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_4th) 
			{
				case 0x01:{last_discount_4th = vipcut_1st;};break;
				case 0x02:{last_discount_4th = vipcut_2nd;};break;
				case 0x03:{last_discount_4th = vipcut_3rd;};break;
				case 0x04:{last_discount_4th = vipcut_4th;};break;
				default :break;
			}         
		}break;
		case 0x35:{ /*微信支付*/
			switch(UserActMessageWriteToFlash.UserAct.MealType_1st)
			{
				case 0x01:{last_discount_1st = vchatcut_1st;};break;
				case 0x02:{last_discount_1st = vchatcut_2nd;};break;
				case 0x03:{last_discount_1st = vchatcut_3rd;};break;
				case 0x04:{last_discount_1st = vchatcut_4th;};break;
				default :break; 
			} 
			switch(UserActMessageWriteToFlash.UserAct.MealType_2nd) 
			{
				case 0x01:{last_discount_2nd = vchatcut_1st;};break;
				case 0x02:{last_discount_2nd = vchatcut_2nd;};break;
				case 0x03:{last_discount_2nd = vchatcut_3rd;};break;
				case 0x04:{last_discount_2nd = vchatcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_3rd) 
			{
				case 0x01:{last_discount_3rd = vchatcut_1st;};break;
				case 0x02:{last_discount_3rd = vchatcut_2nd;};break;
				case 0x03:{last_discount_3rd = vchatcut_3rd;};break;
				case 0x04:{last_discount_3rd = vchatcut_4th;};break;
				default :break;
			}
			switch(UserActMessageWriteToFlash.UserAct.MealType_4th) 
			{
				case 0x01:{last_discount_4th = vchatcut_1st;};break;
				case 0x02:{last_discount_4th = vchatcut_2nd;};break;
				case 0x03:{last_discount_4th = vchatcut_3rd;};break;
				case 0x04:{last_discount_4th = vchatcut_4th;};break;
				default :break;
			}         
		}break;
		default: return false;		
	}
	UserActMessageWriteToFlash.UserAct.LastMealPrice_1st = UserActMessageWriteToFlash.UserAct.MealPrice_1st*last_discount_1st/100;
	UserActMessageWriteToFlash.UserAct.LastMealPrice_2nd = UserActMessageWriteToFlash.UserAct.MealPrice_2nd*last_discount_2nd/100;
	UserActMessageWriteToFlash.UserAct.LastMealPrice_3rd = UserActMessageWriteToFlash.UserAct.MealPrice_3rd*last_discount_3rd/100;
	UserActMessageWriteToFlash.UserAct.LastMealPrice_4th = UserActMessageWriteToFlash.UserAct.MealPrice_4th*last_discount_4th/100;
	UserActMessageWriteToFlash.UserAct.LastMealCost_1st  = UserActMessageWriteToFlash.UserAct.LastMealPrice_1st\
															 *UserActMessageWriteToFlash.UserAct.MealCnt_1st;  
	UserActMessageWriteToFlash.UserAct.LastMealCost_2nd  = UserActMessageWriteToFlash.UserAct.LastMealPrice_2nd\
															 *UserActMessageWriteToFlash.UserAct.MealCnt_2nd;  
	UserActMessageWriteToFlash.UserAct.LastMealCost_3rd  = UserActMessageWriteToFlash.UserAct.LastMealPrice_3rd\
															 *UserActMessageWriteToFlash.UserAct.MealCnt_3rd;  
	UserActMessageWriteToFlash.UserAct.LastMealCost_4th  = UserActMessageWriteToFlash.UserAct.LastMealPrice_4th\
															 *UserActMessageWriteToFlash.UserAct.MealCnt_4th;  
	UserActMessageWriteToFlash.UserAct.LastPayShould = UserActMessageWriteToFlash.UserAct.LastMealCost_1st+UserActMessageWriteToFlash.UserAct.LastMealCost_2nd\
														 +UserActMessageWriteToFlash.UserAct.LastMealCost_3rd+UserActMessageWriteToFlash.UserAct.LastMealCost_4th;
	VariableChage(mealtotoal_cost,UserActMessageWriteToFlash.UserAct.LastPayShould);
	return true;
}

