CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Utilities/STM32_EVAL/STM324x7I_APP/bsp/bsp.c
	/*******************************************************************************
 * 函数名称:GetDiscountValue                                                                   
 * 描    述:获取当前餐品的折扣数据                                                           
 *                  NG                                                             
 * 输    入:支付方式                                                                   
 * 输    出:true / false                                                                   
 * 返    回:void                                                               
 * 修改日期:2013年1月16日                                                                    
 *******************************************************************************/ 
uint8_t GetDiscountValue(uint8_t meal_order)
{
	uint8_t value_return=0;
	switch(meal_order)
	{
		case 0x01:value_return = UserActMessageWriteToFlash.UserAct.LastMealPrice_1st;break;
		case 0x02:value_return = UserActMessageWriteToFlash.UserAct.LastMealPrice_2nd;break;
		case 0x03:value_return = UserActMessageWriteToFlash.UserAct.LastMealPrice_3rd;break;
		case 0x04:value_return = UserActMessageWriteToFlash.UserAct.LastMealPrice_4th;break;
		default:break;
	}
	return value_return;
}
	/*******************************************************************************
 * 函数名称:PowerupAbnormalHandle                                                                    
 * 描    述:开机异常处理，只显示错误标识，更根据密码显示用户操作记录                                                                
 *            首先需要判断是否断电，再判断UserActMessageWriteToFlash.UserAct.paybacke是否大于0，显示用户选择的
				餐品数，未出的餐品数，以及钱数                                                                   
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年5月9日                                                                    
 *******************************************************************************/ 
void PowerupAbnormalHandle(uint32_t err_record_t)
{
	AbnormalHandle(err_record_t);
	err_record = 0;
}

	/*******************************************************************************
 * 函数名称:PollAbnormalHandle                                                                   
 * 描    述:轮询                                                                 
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年5月9日                                                                    
 *******************************************************************************/ 
void PollAbnormalHandle(void)
{
	uint8_t i=0;
	for(i=32;i>0;i--) //32位记录各种异常，开机需要处理 ，可以通过管理员清理错误
	{
		if(err_record&(1<<i))
		AbnormalHandle(i);  
	}   
}

/*******************************************************************************
 * 函数名称:AbnormalHandle                                                                    
 * 描    述:异常处理 ，包含用户数据的显示                                                                
 *           包含开机异常处理，需要进行判断，相当于开机判断                                                                     
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
uint32_t err_flag=0;
void AbnormalHandle(uint32_t err)
{   
	err_record |= (1<<err); //在开始异常处理的时候需要用到
	//printf("err_record2nd 0x%08X\r\n",err_record);
	err_flag = err; //只是在错误处理与判断时需要用到，
	switch(err)
	{
		case outage_err:      //断电：只有在开机的时候判断是否有断电的情况发生 ，计算应该退的钱，还有就是付钱的时候断电
		{            /*取餐出错的情况*/              /*退币出错的情况,包含付钱的时候断电*/
			if((UserActMessageWriteToFlash.UserAct.Meal_totoal!=UserActMessageWriteToFlash.UserAct.Meal_takeout)||(UserActMessageWriteToFlash.UserAct.MoneyBack>0))//先判断是否还有餐品没有取出和再判断用户未退的钱
			{
				/*这里加上调试信息，查看以上连个条件的数值*/
				if(UserActMessageWriteToFlash.UserAct.MealID>0)
				{
				//计算总的应退币数
					UserActMessageWriteToFlash.UserAct.MoneyBackShould +=
					(UserActMessageWriteToFlash.UserAct.MealCnt_1st*UserActMessageWriteToFlash.UserAct.LastMealPrice_1st+UserActMessageWriteToFlash.UserAct.MealCnt_2nd*UserActMessageWriteToFlash.UserAct.LastMealPrice_2nd
					+UserActMessageWriteToFlash.UserAct.MealCnt_3rd*UserActMessageWriteToFlash.UserAct.LastMealPrice_3rd+UserActMessageWriteToFlash.UserAct.MealCnt_4th*UserActMessageWriteToFlash.UserAct.LastMealPrice_4th);                                      
					//计算总的未退币数
					UserActMessageWriteToFlash.UserAct.MoneyBack += 
					(UserActMessageWriteToFlash.UserAct.MealCnt_1st*UserActMessageWriteToFlash.UserAct.LastMealPrice_1st+UserActMessageWriteToFlash.UserAct.MealCnt_2nd*UserActMessageWriteToFlash.UserAct.LastMealPrice_2nd
					+UserActMessageWriteToFlash.UserAct.MealCnt_3rd*UserActMessageWriteToFlash.UserAct.LastMealPrice_3rd+UserActMessageWriteToFlash.UserAct.MealCnt_4th*UserActMessageWriteToFlash.UserAct.LastMealPrice_4th);   
					//计算上传的交易金额
					payfor_meal+=(UserActMessageWriteToFlash.UserAct.MealCnt_1st*UserActMessageWriteToFlash.UserAct.LastMealPrice_1st+UserActMessageWriteToFlash.UserAct.MealCnt_2nd*UserActMessageWriteToFlash.UserAct.LastMealPrice_2nd
					+UserActMessageWriteToFlash.UserAct.MealCnt_3rd*UserActMessageWriteToFlash.UserAct.LastMealPrice_3rd+UserActMessageWriteToFlash.UserAct.MealCnt_4th*UserActMessageWriteToFlash.UserAct.LastMealPrice_4th); 
					//计算已退币的钱（需要处理，要两次退币的数据）
					UserActMessageWriteToFlash.UserAct.MoneyPayBack_Already= (UserActMessageWriteToFlash.UserAct.MoneyBackShould-UserActMessageWriteToFlash.UserAct.MoneyBack);
			
