CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Utilities/STM32_EVAL/STM324x7I_APP/bsp/bsp.c
					//显示用户已付 和  应退  和 已退
					VariableChage(record_UserActPayAlready,UserActMessageWriteToFlash.UserAct.PayAlready);
					//应退的钱 = 总的应该退币的钱
					VariableChage(record_UserActPayBack,UserActMessageWriteToFlash.UserAct.MoneyBackShould);
					//已退的钱 = 总的应该退币的钱- 还未退的钱
					VariableChage(record_UserActPayBackAlready,UserActMessageWriteToFlash.UserAct.MoneyBackShould-UserActMessageWriteToFlash.UserAct.MoneyBack);            
						
					//DataUpload(Failed);//只有当UserActMessageWriteToFlash.UserAct.MealID!=0的时候才上传餐品的数据
					//SaveUserData();
				}
				DisplayAbnormal("E070");
				PageChange(Err_interface);
			}
			else 
			{
				err_record &= ~(1<<err); //如果需要处理其他异常呢
				err_flag= 0;
				return;
			}
		}break;
		case sdcard_err:     //SD卡存储异常
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E000");
			PageChange(Err_interface);                    
			////StatusUploadingFun(0xE000); //状态上送
		}break;
		case billset_err:    //纸币机异常
		{
			PlayMusic(VOICE_11);              
			DisplayAbnormal("E010"); 
			PageChange(Err_interface);  
			//StatusUploadingFun(0xE010); //状态上送
		}break;
		case coinset_err:      //投币机
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E020");
			PageChange(Err_interface);                
			//StatusUploadingFun(0xE020); //状态上送
		}break;
		case coinhooperset_err:    //退币机
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E030");
			PageChange(Err_interface);                
			//StatusUploadingFun(0xE030); //状态上送
			//没有币可退的时候，UserActMessageWriteToFlash.UserAct.Payback 不为0
		}break;
		case coinhooperset_empty:   //找零用光
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E032");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE032); //状态上送
		}break;
		case printer_err:      //打印机异常
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E040");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE040); //状态上送
		}break;
		case cardread_err:     //读卡器异常
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E050");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE050); //状态上送
		}break;
		case network_err:     //网络异常
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E060");
			PageChange(Err_interface);
		}break;
		case signin_err:    //签到异常
		{
			PlayMusic(VOICE_11); 
			DisplayAbnormal("E061");           
			PageChange(Err_interface);  
		}break;
		case upload_err:     //数据上传的时候突然断电
		{
			//DataUpload(Success);
			err_record &= ~(1<<upload_err);
			return;
		};
		case arm_limit: //机械手禁止复位
		{
			if((UserActMessageWriteToFlash.UserAct.Meal_totoal!=UserActMessageWriteToFlash.UserAct.Meal_takeout)||(UserActMessageWriteToFlash.UserAct.MoneyBack>0))//先判断是否还有餐品没有取出和再判断用户未退的钱
			{
				/*这里加上调试信息，查看以上连个条件的数值*/
				if(UserActMessageWriteToFlash.UserAct.MealID>0)
				{
					//SaveUserData();
				}
				DisplayAbnormal("E100");
				PageChange(Err_interface);
			}
			else 
			{
				err_record &= ~(1<<err); //如果需要处理其他异常呢
				err_flag= 0;
				return;
			}
		}break;           
		case X_timeout:        //x轴传感器超时
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E101");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE101); //状态上送
			//DataUpload(Failed);
		}break;
		case X_leftlimit:      //马达左动作极限输出
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E102");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE102); //状态上送
			//DataUpload(Failed);
		}break;
		case X_rightlimit:     //马达右动作极限输出
		{
			DisplayAbnormal("E103");
			PlayMusic(VOICE_11);
			//StatusUploadingFun(0xE103); //状态上送  
			PageChange(Err_interface);
			//DataUpload(Failed);
		}break;
		case mealtake_timeout: //取餐口传感器超时
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E201");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE201); //状态上送
			//DataUpload(Failed);
		}break;
		case Y_timeout:        //y轴传感器超时
		{
			PlayMusic(VOICE_11);
			DisplayAbnormal("E301");    
			PageChange(Err_interface);
			//StatusUploadingFun(0xE302); //状态上送
			//DataUpload(Failed);
		}break;
		case link_timeout:     //链接超时
		{
			PlayMusic(VOICE_11);
			DisplayAbnormal("E401");    
			PageChange(Err_interface);
			//StatusUploadingFun(0xE401); //状态上送
		}break;
		case Z_timeout:        //z轴传感器超时
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E501");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE501); //状态上送
			//DataUpload(Failed);
		}break;
		case Z_uplimit:        //z轴马达上动作超出
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E502");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE502); //状态上送
			//DataUpload(Failed);
		}break;
		case Z_downlimit:      //z马达下动作超出
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E503");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE503); //状态上送
			//DataUpload(Failed);
		}break;
		case solenoid_timeout: //电磁阀超时  ???有时有异常
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E601");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE601); //状态上送
			//DataUpload(Failed);
		}break;
		case Eeprom_erro:      //eeprom 异常
		{
			PlayMusic(VOICE_11);  
			DisplayAbnormal("E711");
			PageChange(Err_interface);
			//StatusUploadingFun(0xE711); //状态上送
			//DataUpload(Failed);
		}break;
		case SendUR6Erro:      //机械手串口通讯超时
		{
			PlayMusic(VOICE_11);
			DisplayAbnormal("E801");    
			PageChange(Err_interface);
			//StatusUploadingFun(0xE801); //状态上送
			//DataUpload(Failed);
		}break;
		case GetMealError:     //机械手5秒取不到餐
		{
			PlayMusic(VOICE_11);
			DisplayAbnormal("E802");    
			PageChange(Err_interface);
			//StatusUploadingFun(0xE802); //状态上送
			//DataUpload(Failed);
		}break;
		case MealNoAway:       //餐在出餐口20秒还未被取走
		{
			PlayMusic(VOICE_11);
			DisplayAbnormal("E803");    
			PageChange(Err_interface);
			//StatusUploadingFun(0xE803); //状态上送
			//DataUpload(Success);
		}break;
		default:break;
	}
	//SaveUserData(); //错误处理一次数据保存一次
	while(1)
	{
		DealSeriAceptData();
		if(err_flag==0)
		{
			if(err_record&(1<<arm_limit)) //开机的机械手禁止复位
			{
				PageChange(OnlymachieInit_interface);                   
				//OnlymachieInit(); //机械手的初始化
				err_record &= ~(1<<arm_limit);
				RTC_WriteBackupRegister(RTC_BKP_DR13, err_record);
			}
			else
			{
				UserActMessageWriteToFlash.UserAct.MoneyBack=0;
				UserActMessageWriteToFlash.UserAct.MoneyBackShould=0;
				UserActMessageWriteToFlash.UserAct.MoneyBackAlready=0;
				ClearUserBuffer();
				//SaveUserData();
			}
			if(err_record>=(1<<X_timeout))//如果是机械售错误值上传一次数据，对高位取反
			{
				err_record&=~0xFFFF0000; //只显示一次异常
			}
			err_record &= ~(1<<err); //一次只处理一次异常
			RTC_WriteBackupRegister(RTC_BKP_DR13, err_record);
			break;
		}
		MachineHeatSet();//防止进入错误处理的时候卡死
	}
}
	/*******************************************************************************
 * 函数名称:ErrRecHandle                                                                     
 * 描    述:错误记录处理                                                              
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年7月2日                                                                    
 *******************************************************************************/ 
void ErrRecHandle(void)
{
	if(err_record!=0) //当有错误记录，需要进行处理
	{
		AbnormalHandle(outage_err);//相当于开机异常处理
		if(err_record&(1<<upload_err))
		{
			if(UserActMessageWriteToFlash.UserAct.MealID!=0)
			AbnormalHandle(upload_err);//需要处理数据上传的断电
		}
		err_record=0;
	}
	else
	{
		ClearUserBuffer(); //清除之前读取的数据
		UserActMessageWriteToFlash.UserAct.MoneyBack=0;//
	}
	//SaveUserData();  
}

