CaishunChen/STM32F4x7_ETH_LwIP_V1.1.0/Utilities/STM32_EVAL/STM324x7I_APP/bsp/bsp.c
 /*
	PVD ---- 低电压检测                抢占优先级  0      亚优先级 0        用于保护sd卡
	硬币机               外部中断5                 0                1
	纸币机               串口4                     0                2
	IC卡                 串口2                     0                3  
	屏幕                 串口中断3                 0                4
	打印                 串口1                     0                6
	退币倒计时           定时器4                   1                0
	定时倒计时60s        定时器3                   1                1
 */
	/*******************************************************************************
 * 函数名称:hardfawreInit                                                                     
 * 描    述:硬件初始化                                                                   
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2013年8月28日                                                                    
 *******************************************************************************/ 
void HardwaveInit(void)
{
	Uart4_Configuration();     //纸币机串口初始化 1, 2
	Uart1_Configuration();     //打印机串口初始化
	Uart3_Configuration();     //串口屏初始化  0 , 3
	Uart5_Configuration();     //服务器通信初始化
	AppRTC_Init();             //RTC初始化
	RTC_TimeRegulate();      //设置时间
	
	InitCoins();               //投币机初始化
	InitMiniGPIO() ;           //退币器始化   
	InitVoice();               //语音初始化
	SPI_Flash_Init();          //flash提前初始化
	
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Disable); //关闭看门狗 
}   
